"""
Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
[2, 3, 4, 5, 6] => [12, 15, 16]
[2, 3, 5, 6] => [12, 15]
"""

lst = list(map(int, input('введите числа списка через пробел: ').split()))
print(lst)

result = []
while len(lst) > 0:
    a = lst.pop(0)
    if len(lst) > 0:
        b = lst.pop()
    else:
        b = a
    result.append(a * b)

print(result)
